ERM/src/Documents/PenaltyCalculation/PenaltyCalculation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PenaltyCalculation</name>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Calculation</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntiites</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Client</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Invoice</types>
      </type>
    </attributes>
    <attributes>
      <name>DueDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>PenaltyDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RemainingAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RemainingAmountUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OverdueDays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PenaltyAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsProblem</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERM/src/AccumulationRegisters/BilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>BilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/Payments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>Payments</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CashBatch</v8:Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CashBatch</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CashBatch</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/LawsonDepositDates/LawsonDepositDates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LawsonDepositDates</name>
  <resources>
    <name>DepositDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.Memo</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CashBatch</name>
    <type>
      <types>DocumentRef.CashBatch</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Documents/PenaltyCalculation/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьДанныеПоБиллингу(СтруктураПараметров, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BilledARОстатки.Source КАК Source,
	|	BilledARОстатки.Company КАК Company,
	|	BilledARОстатки.Client КАК Client,
	|	BilledARОстатки.AU КАК AU,
	|	BilledARОстатки.Account КАК Account,
	|	BilledARОстатки.LegalEntity КАК LegalEntity,
	|	BilledARОстатки.ClientID КАК ClientID,
	|	BilledARОстатки.Invoice КАК Invoice,
	|	BilledARОстатки.Currency КАК Currency,
	|	BilledARОстатки.AmountОстаток КАК AmountОстаток
	|ПОМЕСТИТЬ ВТ_АктуальныеОстатки
	|ИЗ
	|	РегистрНакопления.BilledAR.Остатки(
	|			,
	|			Source В (&Sources)
	|				И Invoice.DueDateTo <> ДАТАВРЕМЯ(1, 1, 1)
	|				И Invoice.DueDateTo <= &КонецПериодаРасчета) КАК BilledARОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	PaymentsОбороты.Source КАК Source,
	|	PaymentsОбороты.Company КАК Company,
	|	PaymentsОбороты.Client КАК Client,
	|	PaymentsОбороты.AU КАК AU,
	|	PaymentsОбороты.Account КАК Account,
	|	PaymentsОбороты.LegalEntity КАК LegalEntity,
	|	PaymentsОбороты.ClientID КАК ClientID,
	|	PaymentsОбороты.Invoice КАК Invoice,
	|	PaymentsОбороты.Currency КАК Currency,
	|	PaymentsОбороты.AmountОборот КАК AmountОборот
	|ПОМЕСТИТЬ ВТ_ОплатыСНачалаПериодаРасчета
	|ИЗ
	|	РегистрНакопления.Payments.Обороты(
	|			&НачалоПериодаРасчета,
	|			,
	|			,
	|			Source В (&Sources)
	|				И Invoice.DueDateTo <> ДАТАВРЕМЯ(1, 1, 1)
	|				И Invoice.DueDateTo <= &КонецПериодаРасчета) КАК PaymentsОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	PaymentsОбороты.Source КАК Source,
	|	PaymentsОбороты.Company КАК Company,
	|	PaymentsОбороты.Client КАК Client,
	|	PaymentsОбороты.AU КАК AU,
	|	PaymentsОбороты.Account КАК Account,
	|	PaymentsОбороты.LegalEntity КАК LegalEntity,
	|	PaymentsОбороты.ClientID КАК ClientID,
	|	PaymentsОбороты.Invoice КАК Invoice,
	|	PaymentsОбороты.Currency КАК Currency,
	|	PaymentsОбороты.AmountОборот КАК AmountОборот,
	|	PaymentsОбороты.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ОплатыЗаПериодРасчета
	|ИЗ
	|	РегистрНакопления.Payments.Обороты(
	|			&НачалоПериодаРасчета,
	|			&КонецПериодаРасчета,
	|			День,
	|			Source В (&Sources)
	|				И Invoice.DueDateTo <> ДАТАВРЕМЯ(1, 1, 1)
	|				И Invoice.DueDateTo <= &КонецПериодаРасчета) КАК PaymentsОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	LawsonDepositDatesInv.Invoice КАК Document,
	|	МАКСИМУМ(LawsonDepositDatesInv.DepositDate) КАК DepositDate
	|ПОМЕСТИТЬ ВТ_LawsonDepositDates
	|ИЗ
	|	РегистрСведений.LawsonDepositDates КАК LawsonDepositDatesInv
	|ГДЕ
	|	LawsonDepositDatesInv.Invoice В
	|			(ВЫБРАТЬ
	|				ОплатыЗаПериодРасчета.Invoice
	|			ИЗ
	|				ВТ_ОплатыЗаПериодРасчета КАК ОплатыЗаПериодРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	LawsonDepositDatesInv.Invoice
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(LawsonDepositDatesInv.DepositDate) МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОплатыЗаПериодРасчета.Source КАК Source,
	|	ВТ_ОплатыЗаПериодРасчета.Company КАК Company,
	|	ВТ_ОплатыЗаПериодРасчета.Client КАК Client,
	|	ВТ_ОплатыЗаПериодРасчета.AU КАК AU,
	|	ВТ_ОплатыЗаПериодРасчета.Account КАК Account,
	|	ВТ_ОплатыЗаПериодРасчета.LegalEntity КАК LegalEntity,
	|	ВТ_ОплатыЗаПериодРасчета.ClientID КАК ClientID,
	|	ВТ_ОплатыЗаПериодРасчета.Invoice КАК Invoice,
	|	ВТ_ОплатыЗаПериодРасчета.Currency КАК Currency,
	|	ВТ_ОплатыЗаПериодРасчета.AmountОборот КАК AmountОборот,
	|	ЕСТЬNULL(ВТ_LawsonDepositDates.DepositDate, ВТ_ОплатыЗаПериодРасчета.Период) КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА ВТ_ОплатыЗаПериодРасчета.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.Lawson)
	|				И ВТ_LawsonDepositDates.DepositDate ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПроблемаРасчета
	|ПОМЕСТИТЬ ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты
	|ИЗ
	|	ВТ_ОплатыЗаПериодРасчета КАК ВТ_ОплатыЗаПериодРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_LawsonDepositDates КАК ВТ_LawsonDepositDates
	|		ПО ВТ_ОплатыЗаПериодРасчета.Invoice = ВТ_LawsonDepositDates.Document
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Source КАК Source,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Company КАК Company,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Client КАК Client,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.AU КАК AU,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Account КАК Account,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.LegalEntity КАК LegalEntity,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.ClientID КАК ClientID,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Invoice КАК Invoice,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Currency КАК Currency,
	|	СУММА(ВложенныйЗапросАктуальныеОстаткиБезОплат.AmountОстаток) КАК AmountОстаток,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплаты,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Invoice.DueDateTo КАК DueDateTo,
	|	1 КАК ПриоритетОбработки,
	|	ЛОЖЬ КАК ЕстьПроблемаРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_АктуальныеОстатки.Source КАК Source,
	|		ВТ_АктуальныеОстатки.Company КАК Company,
	|		ВТ_АктуальныеОстатки.Client КАК Client,
	|		ВТ_АктуальныеОстатки.AU КАК AU,
	|		ВТ_АктуальныеОстатки.Account КАК Account,
	|		ВТ_АктуальныеОстатки.LegalEntity КАК LegalEntity,
	|		ВТ_АктуальныеОстатки.ClientID КАК ClientID,
	|		ВТ_АктуальныеОстатки.Invoice КАК Invoice,
	|		ВТ_АктуальныеОстатки.Currency КАК Currency,
	|		ВТ_АктуальныеОстатки.AmountОстаток КАК AmountОстаток
	|	ИЗ
	|		ВТ_АктуальныеОстатки КАК ВТ_АктуальныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ОплатыСКонцаПериодаРасчета.Source,
	|		ВТ_ОплатыСКонцаПериодаРасчета.Company,
	|		ВТ_ОплатыСКонцаПериодаРасчета.Client,
	|		ВТ_ОплатыСКонцаПериодаРасчета.AU,
	|		ВТ_ОплатыСКонцаПериодаРасчета.Account,
	|		ВТ_ОплатыСКонцаПериодаРасчета.LegalEntity,
	|		ВТ_ОплатыСКонцаПериодаРасчета.ClientID,
	|		ВТ_ОплатыСКонцаПериодаРасчета.Invoice,
	|		ВТ_ОплатыСКонцаПериодаРасчета.Currency,
	|		ВТ_ОплатыСКонцаПериодаРасчета.AmountОборот
	|	ИЗ
	|		ВТ_ОплатыСНачалаПериодаРасчета КАК ВТ_ОплатыСКонцаПериодаРасчета) КАК ВложенныйЗапросАктуальныеОстаткиБезОплат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Source,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Company,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Client,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.AU,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Account,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.LegalEntity,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.ClientID,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Invoice,
	|	ВложенныйЗапросАктуальныеОстаткиБезОплат.Currency
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапросАктуальныеОстаткиБезОплат.AmountОстаток) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Source,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Company,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Client,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.AU,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Account,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.LegalEntity,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.ClientID,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Invoice,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Currency,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.AmountОборот,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.ДатаОплаты,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.Invoice.DueDateTo,
	|	2,
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты.ЕстьПроблемаРасчета
	|ИЗ
	|	ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты КАК ВТ_ОплатыЗаПериодРасчетаСДатамиОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетОбработки,
	|	ДатаОплаты
	|ИТОГИ ПО
	|	Invoice";
	
	ДанныеПоШтрафам = Новый ТаблицаЗначений;
	ДанныеПоШтрафам.Колонки.Добавить("Company");
	ДанныеПоШтрафам.Колонки.Добавить("LegalEntity");
	ДанныеПоШтрафам.Колонки.Добавить("AU");
	ДанныеПоШтрафам.Колонки.Добавить("Client");
	ДанныеПоШтрафам.Колонки.Добавить("Contract");
	ДанныеПоШтрафам.Колонки.Добавить("Invoice");
	ДанныеПоШтрафам.Колонки.Добавить("DueDate");
	ДанныеПоШтрафам.Колонки.Добавить("Currency");
	ДанныеПоШтрафам.Колонки.Добавить("PenaltyDate");
	ДанныеПоШтрафам.Колонки.Добавить("PenaltyDate");
	ДанныеПоШтрафам.Колонки.Добавить("RemainingAmount");
	ДанныеПоШтрафам.Колонки.Добавить("RemainingAmountUSD");
	ДанныеПоШтрафам.Колонки.Добавить("OverDueDays");
	ДанныеПоШтрафам.Колонки.Добавить("Percent");
	ДанныеПоШтрафам.Колонки.Добавить("PenaltyAmount");
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("ДанныеПоБиллингу", ДанныеПоШтрафам);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры
	
#КонецЕсли
